xpacks/stm32f7-cmsis/CMSIS/Driver/CAN_STM32F7xx.c
// Local variables and structures
static uint8_t                     can_driver_powered    [CAN_CTRL_NUM];
static uint8_t                     can_driver_initialized[CAN_CTRL_NUM];
static uint8_t                     can_obj_cfg           [CAN_CTRL_NUM][CAN_TOT_OBJ_NUM];
static ARM_CAN_SignalUnitEvent_t   CAN_SignalUnitEvent   [CAN_CTRL_NUM];
static ARM_CAN_SignalObjectEvent_t CAN_SignalObjectEvent [CAN_CTRL_NUM];


// Helper Functions

/**
  \fn          int32_t CANx_AddFilter (uint32_t obj_idx, CAN_FILTER_TYPE filter_type, uint32_t id, uint32_t mask, uint8_t x)
  \brief       Add receive filter for specified id or id with mask.
  \param[in]   obj_idx      Receive object index assignment
  \param[in]   filter_type  Type of filter to add
                 - CAN_FILTER_TYPE_EXACT_ID:    exact id filter (id only)
                 - CAN_FILTER_TYPE_MASKABLE_ID: maskable filter (id and mask)
  \param[in]   id           Identifier
  \param[in]   mask         Identifier Mask
  \param[in]   x            Controller number (0..1)
  \return      execution status
*/
static int32_t CANx_AddFilter (uint32_t obj_idx, CAN_FILTER_TYPE filter_type, uint32_t id, uint32_t mask, uint8_t x) {
  uint32_t     fa1r, frx, fry, msk;
  uint8_t      bank, bank_end;
  int32_t      status;

  if (x >= CAN_CTRL_NUM)         { return ARM_DRIVER_ERROR;           }
  if (obj_idx >= CAN_RX_OBJ_NUM) { return ARM_DRIVER_ERROR_PARAMETER; }
  if (x == 1U)                   { bank = CAN1_FILTER_BANK_NUM; bank_end = CAN1_FILTER_BANK_NUM + CAN2_FILTER_BANK_NUM; }
  else                           { bank = 0U;                   bank_end = CAN1_FILTER_BANK_NUM;                        }
  if (bank >= bank_end)          { return ARM_DRIVER_ERROR;           }

  status = ARM_DRIVER_OK;
  CAN1->FMR |= CAN_FMR_FINIT;                                           // Enter filter initialization mode

  fa1r = CAN1->FA1R;
  msk  = (uint32_t)1U << bank;

  if ((id & ARM_CAN_ID_IDE_Msk) != 0U) {                                // Extended Identifier
    frx = (id << 3) | CAN_FRx_32BIT_IDE;                                // id + IDE
    switch (filter_type) {
      case CAN_FILTER_TYPE_EXACT_ID:
        fry = (id << 3) | CAN_FRx_32BIT_IDE | CAN_FRx_32BIT_RTR;        // id + IDE + RTR
        while (bank <= bank_end) {                                      // Find empty place for id
          if (bank == bank_end) {                                       // If no free found exit
            status = ARM_DRIVER_ERROR;
            break;
          }
          if ((fa1r & msk) == 0U) {                                     // If filter is not active
            CAN1->FM1R |=  msk;                                         // Select identifier list mode
            CAN1->FS1R |=  msk;                                         // Select single 32-bit scale configuration
            if (obj_idx & 1U) {
              CAN1->FFA1R |=  msk;                                      // Assign to FIFO1
            } else {
              CAN1->FFA1R &= ~msk;                                      // Assign to FIFO0
            }
            CAN1->sFilterRegister[bank].FR1 = frx;                      // id + IDE
            CAN1->sFilterRegister[bank].FR2 = fry;                      // id + IDE + RTR
            break;
          }
          msk <<= 1U;
          bank++;
        }
        break;
      case CAN_FILTER_TYPE_MASKABLE_ID:
        fry = (mask << 3) | CAN_FRx_32BIT_IDE;                          // mask + IDE
        while (bank <= bank_end) {                                      // Find empty place for id
          if (bank == bank_end) {                                       // If no free found exit
            status = ARM_DRIVER_ERROR;
            break;
          }
          if ((fa1r & msk) == 0U) {                                     // If filter is not active
            CAN1->FM1R &= ~msk;                                         // Select identifier mask mode
            CAN1->FS1R |=  msk;                                         // Select single 32-bit scale configuration
            if (obj_idx & 1U) {
              CAN1->FFA1R |=  msk;                                      // Assign to FIFO1
            } else {
              CAN1->FFA1R &= ~msk;                                      // Assign to FIFO0
            }
            CAN1->sFilterRegister[bank].FR1 = frx;                      // id + IDE
            CAN1->sFilterRegister[bank].FR2 = fry;                      // mask + IDE
            break;
          }
          msk <<= 1U;
          bank++;
        }
        break;
      default:
        status = ARM_DRIVER_ERROR_PARAMETER;
        break;
    }
  } else {                                                              // Standard Identifier
    switch (filter_type) {
      case CAN_FILTER_TYPE_EXACT_ID:
        frx = ((id & 0xFFFFU) <<  5) |                                  // Low 16 bits = id
              ((id & 0xFFFFU) << 21) | CAN_FRx_16BIT_H_RTR;             // High 16 bits = id + RTR
        while (bank <= bank_end) {                                      // Find empty place for id
          if (bank == bank_end) {                                       // If no free found exit
            status = ARM_DRIVER_ERROR;
            break;
          }
          if ((fa1r & msk) == 0U) {                                     // If filter is not active
            CAN1->FM1R |=  msk;                                         // Select identifier list mode
            CAN1->FS1R &= ~msk;                                         // Select dual 16-bit scale configuration
            if (obj_idx & 1U) {
              CAN1->FFA1R |=  msk;                                      // Assign to FIFO1
            } else {
              CAN1->FFA1R &= ~msk;                                      // Assign to FIFO0
            }
            CAN1->sFilterRegister[bank].FR1 = frx;
            break;
          } else if  (((CAN1->FM1R & msk) != 0U) &&                     // If identifier list mode
                      ((CAN1->FS1R & msk) == 0U) &&                     // If dual 16-bit scale configuration
                     (((CAN1->FFA1R >> bank) & 1U) == obj_idx)) {       // If bank has same FIFO assignment as requested
            if         (CAN1->sFilterRegister[bank].FR1 == 0U) {        // If n and n+1 entry are not used
              CAN1->FA1R &= ~msk;                                       // Put filter in inactive mode
              CAN1->sFilterRegister[bank].FR1 = frx;                    // id and id + RTR
              break;
            } else if (CAN1->sFilterRegister[bank].FR2 == 0U) {         // If n+2 and n+3 entry are not used
              CAN1->FA1R &= ~msk;                                       // Put filter in inactive mode
              CAN1->sFilterRegister[bank].FR2 = frx;                    // id and id + RTR
              break;
            }
          }
          msk <<= 1U;
          bank++;
        }
        break;
      case CAN_FILTER_TYPE_MASKABLE_ID:
        frx = ((id   & 0xFFFFU) <<  5) |                                // Low 16 bits = id
              ((mask & 0xFFFFU) << 21) ;                                // High 16 bits = mask
        if ((mask & ARM_CAN_ID_IDE_Msk) != 0U) {                        // If IDE masking enabled
          frx |= CAN_FRx_16BIT_H_RTR;                                   // High 16 bits = mask + IDE
        }
        while (bank <= bank_end) {                                      // Find empty place for id
          if (bank == bank_end) {                                       // If no free found exit
            status = ARM_DRIVER_ERROR;
            break;
          }
          if ((fa1r & msk) == 0U) {                                     // If filter is not active
            CAN1->FM1R &= ~msk;                                         // Select identifier mask mode
            CAN1->FS1R &= ~msk;                                         // Select dual 16-bit scale configuration
            if (obj_idx & 1U) {
              CAN1->FFA1R |=  msk;                                      // Assign to FIFO1
            } else {
              CAN1->FFA1R &= ~msk;                                      // Assign to FIFO0
            }
            CAN1->sFilterRegister[bank].FR1 = frx;
            break;
          } else if ((((CAN1->FM1R | CAN1->FS1R) & msk) == 0U) &&       // If identifier mask mode and dual 16-bit scale configuration
                     (((CAN1->FFA1R >> bank) & 1U) == obj_idx))  {      // If bank has same FIFO assignment as requested
            if         (CAN1->sFilterRegister[bank].FR1 == 0U) {        // If n entry is not used
              CAN1->FA1R &= ~msk;                                       // Put filter in inactive mode
              CAN1->sFilterRegister[bank].FR1 = frx;                    // id and mask
              break;
            } else if  (CAN1->sFilterRegister[bank].FR2 == 0U) {        // If n+1 entry is not used
              CAN1->FA1R &= ~msk;                                       // Put filter in inactive mode
              CAN1->sFilterRegister[bank].FR2 = frx;                    // id and mask
              break;
            }
          }
          msk <<= 1U;
          bank++;
        }
        break;
      default:
        status = ARM_DRIVER_ERROR_PARAMETER;
        break;
    }
  }

  if (status == ARM_DRIVER_OK) {
    CAN1->FA1R |= msk;                                                  // Put filter in active mode
  }
  CAN1->FMR  &= ~CAN_FMR_FINIT;                                         // Exit filter initialization mode

