xpacks/stm32f7-cmsis/CMSIS/Driver/CAN_STM32F7xx.c
  return status;
}

/**
  \fn          int32_t CANx_RemoveFilter (uint32_t obj_idx, CAN_FILTER_TYPE filter_type, uint32_t id, uint32_t mask, uint8_t x)
  \brief       Remove receive filter for specified id or id with mask.
  \param[in]   obj_idx      Receive object index assignment
  \param[in]   filter_type  Type of filter to remove
                 - CAN_FILTER_TYPE_EXACT_ID:    exact id filter (id only)
                 - CAN_FILTER_TYPE_MASKABLE_ID: maskable filter (id and mask)
  \param[in]   id           Identifier
  \param[in]   mask         Identifier Mask
  \param[in]   x            Controller number (0..1)
  \return      execution status
*/
static int32_t CANx_RemoveFilter (uint32_t obj_idx, CAN_FILTER_TYPE filter_type, uint32_t id, uint32_t mask, uint8_t x) {
  uint32_t     fa1r, frx, fry, msk;
  int32_t      status;
  uint8_t      bank, bank_end;

  if (x >= CAN_CTRL_NUM)         { return ARM_DRIVER_ERROR;           }
  if (obj_idx >= CAN_RX_OBJ_NUM) { return ARM_DRIVER_ERROR_PARAMETER; }
  if (x == 1U)                   { bank = CAN1_FILTER_BANK_NUM; bank_end = CAN1_FILTER_BANK_NUM + CAN2_FILTER_BANK_NUM; }
  else                           { bank = 0U;                   bank_end = CAN1_FILTER_BANK_NUM;                        }
  if (bank >= bank_end)          { return ARM_DRIVER_ERROR;           }

  status = ARM_DRIVER_OK;
  CAN1->FMR |= CAN_FMR_FINIT;                                           // Enter filter initialization mode

  fa1r = CAN1->FA1R;
  msk  = (uint32_t)1U << bank;

  if ((id & ARM_CAN_ID_IDE_Msk) != 0U) {                                // Extended Identifier
    frx = (id << 3) | CAN_FRx_32BIT_IDE;                                // id + IDE
    switch (filter_type) {
      case CAN_FILTER_TYPE_EXACT_ID:
        fry = (id << 3) | CAN_FRx_32BIT_IDE | CAN_FRx_32BIT_RTR;        // id + IDE + RTR
        while (bank <= bank_end) {                                      // Find empty place for id
          if (bank == bank_end) {                                       // If no free found exit
            status = ARM_DRIVER_ERROR;
            break;
          }
          if (((fa1r & msk) != 0U) &&                                   // If filter is active
             (((CAN1->FM1R & CAN1->FS1R) & msk) != 0U) &&               // If identifier list mode and single 32-bit scale configuration
             (((CAN1->FFA1R >> bank) & 1U) == obj_idx) &&               // If bank has same FIFO assignment as requested
             (CAN1->sFilterRegister[bank].FR1 == frx) &&
             (CAN1->sFilterRegister[bank].FR2 == fry)) {
            CAN1->FA1R &= ~msk;                                         // Put filter in inactive mode
            CAN1->sFilterRegister[bank].FR1 = 0U;
            CAN1->sFilterRegister[bank].FR2 = 0U;
            break;
          }
          msk <<= 1U;
          bank++;
       }
        break;
      case CAN_FILTER_TYPE_MASKABLE_ID:
        fry = (mask << 3) | CAN_FRx_32BIT_IDE;                          // mask + IDE
        while (bank <= bank_end) {                                      // Find empty place for id
          if (bank == bank_end) {                                       // If no free found exit
            status = ARM_DRIVER_ERROR;
            break;
          }
          if (((fa1r & msk) != 0U) &&                                   // If filter is active
              ((CAN1->FM1R & msk) == 0U) &&                             // If identifier mask mode
              ((CAN1->FS1R & msk) != 0U) &&                             // If single 32-bit scale configuration
             (((CAN1->FFA1R >> bank) & 1U) == obj_idx)  &&              // If bank has same FIFO assignment as requested
             (CAN1->sFilterRegister[bank].FR1 == frx) &&
             (CAN1->sFilterRegister[bank].FR2 == fry)) {
            CAN1->FA1R &= ~msk;                                         // Put filter in inactive mode
            CAN1->sFilterRegister[bank].FR1 = 0U;
            CAN1->sFilterRegister[bank].FR2 = 0U;
            break;
          }
          msk <<= 1U;
          bank++;
        }
        break;
      default:
        status = ARM_DRIVER_ERROR_PARAMETER;
        break;
    }
  } else {                                                              // Standard Identifier
    switch (filter_type) {
      case CAN_FILTER_TYPE_EXACT_ID:
        frx = ((id & 0xFFFFU) <<  5) |                                  // Low 16 bits = id
              ((id & 0xFFFFU) << 21) | CAN_FRx_16BIT_H_RTR;             // High 16 bits = id + RTR
        while (bank <= bank_end) {                                      // Find empty place for id
          if (bank == bank_end) {                                       // If no free found exit
            status = ARM_DRIVER_ERROR;
            break;
          }
          if (((fa1r & msk) != 0U)&&                                    // If filter is active
              ((CAN1->FM1R & msk) != 0U) &&                             // If identifier list mode
              ((CAN1->FS1R & msk) == 0U) &&                             // If dual 16-bit scale configuration
             (((CAN1->FFA1R >> bank) & 1U) == obj_idx)) {               // If bank has same FIFO assignment as requested
            if        (CAN1->sFilterRegister[bank].FR1 == frx) {
              CAN1->FA1R &= ~msk;                                       // Put filter in inactive mode
              CAN1->sFilterRegister[bank].FR1 = 0U;
              break;
            } else if (CAN1->sFilterRegister[bank].FR2 == frx) {
              CAN1->FA1R &= ~msk;                                       // Put filter in inactive mode
              CAN1->sFilterRegister[bank].FR2 = 0U;
              break;
            }
          }
          msk <<= 1U;
          bank++;
        }
        break;
      case CAN_FILTER_TYPE_MASKABLE_ID:
        frx = ((id   & 0xFFFFU) <<  5) |                                // Low 16 bits = id
              ((mask & 0xFFFFU) << 21) ;                                // High 16 bits = mask
        if ((mask & ARM_CAN_ID_IDE_Msk) != 0U) {                        // If IDE masking enabled
          frx |= CAN_FRx_16BIT_H_IDE;                                   // High 16 bits = mask + IDE
        }
        while (bank <= bank_end) {                                      // Find empty place for id
          if (bank == bank_end) {                                       // If no free found exit
            status = ARM_DRIVER_ERROR;
            break;
          }
          if (((fa1r & msk) != 0U) &&                                   // If filter is active
             (((CAN1->FM1R | CAN1->FS1R) & msk) == 0U) &&               // If identifier mask mode and dual 16-bit scale configuration
             (((CAN1->FFA1R >> bank) & 1U) == obj_idx)) {               // If bank has same FIFO assignment as requested
            if        (CAN1->sFilterRegister[bank].FR1 == frx) {
              CAN1->FA1R &= ~msk;                                       // Put filter in inactive mode
              CAN1->sFilterRegister[bank].FR1 = 0U;
              break;
            } else if (CAN1->sFilterRegister[bank].FR2 == frx) {
              CAN1->FA1R &= ~msk;                                       // Put filter in inactive mode
              CAN1->sFilterRegister[bank].FR2 = 0U;
              break;
            }
          }
          msk <<= 1U;
          bank++;
        }
        break;
      default:
        status = ARM_DRIVER_ERROR_PARAMETER;
        break;
    }
  }

  if ((status == ARM_DRIVER_OK)                   && 
     ((CAN1->sFilterRegister[bank].FR1 != 0U)  || 
      (CAN1->sFilterRegister[bank].FR2 != 0U))) {
    CAN1->FA1R |= msk;                                                  // Put filter in active mode
  }
  CAN1->FMR  &= ~CAN_FMR_FINIT;                                         // Exit filter initialization mode

