xpacks/stm32f7-cmsis/CMSIS/Driver/CAN_STM32F7xx.c
#if (MX_CAN1 == 1U)
      if (x == 0U) {
        // Enable clock for CAN1 peripheral
        RCC->APB1ENR  |=  RCC_APB1ENR_CAN1EN;
      }
#endif
#if (MX_CAN2 == 1U)
      if (x == 1U) {
        // Enable clock for CAN1 and CAN2 peripheral
        RCC->APB1ENR  |=  RCC_APB1ENR_CAN1EN;
        RCC->APB1ENR  |=  RCC_APB1ENR_CAN2EN;
      }
#endif

      ptr_CAN->IER = 0U;                        // Disable Interrupts

      ptr_CAN->MCR = CAN_MCR_RESET;             // Reset CAN controller
      while ((ptr_CAN->MCR & CAN_MCR_RESET) != 0U);

      memset(&can_obj_cfg[x][0], 0, CAN_TOT_OBJ_NUM);

#if (MX_CAN1 == 1U)
      if (x == 0U) {
#if defined(RTE_DEVICE_FRAMEWORK_CLASSIC)
        RCC->APB1RSTR |=  RCC_APB1RSTR_CAN1RST;
        __NOP(); __NOP(); __NOP(); __NOP(); 
        RCC->APB1ENR  &= ~RCC_APB1ENR_CAN1EN;
#else
        if (hcan1.Instance != NULL) { HAL_CAN_DeInit (&hcan1); }
#endif
      }
#endif
#if (MX_CAN2 == 1U)
      if (x == 1U) {
#if defined(RTE_DEVICE_FRAMEWORK_CLASSIC)
        RCC->APB1RSTR |=  RCC_APB1RSTR_CAN2RST;
        __NOP(); __NOP(); __NOP(); __NOP(); 
        RCC->APB1ENR  &= ~RCC_APB1ENR_CAN2EN;
#else
        if (hcan2.Instance != NULL) { HAL_CAN_DeInit (&hcan2); }
#endif
#if (MX_CAN1 == 0U)
        RCC->APB1RSTR |=  RCC_APB1RSTR_CAN1RST;
        __NOP(); __NOP(); __NOP(); __NOP(); 
        RCC->APB1ENR  &= ~RCC_APB1ENR_CAN1EN;
#endif
      }
#endif
      break;

    case ARM_POWER_FULL:
      if (can_driver_initialized[x] == 0U) { return ARM_DRIVER_ERROR; }
      if (can_driver_powered[x]     != 0U) { return ARM_DRIVER_OK;    }

#if (MX_CAN1 == 1U)
      if (x == 0U) {
#if defined(RTE_DEVICE_FRAMEWORK_CLASSIC)
        RCC->APB1ENR  |=  RCC_APB1ENR_CAN1EN;
        RCC->APB1RSTR |=  RCC_APB1RSTR_CAN1RST;
        __NOP(); __NOP(); __NOP(); __NOP(); 
        RCC->APB1RSTR &= ~RCC_APB1RSTR_CAN1RST;
#else
        HAL_CAN_MspInit(&hcan1);
#endif
      }
#endif
#if (MX_CAN2 == 1U)
      if (x == 1U) {
#if defined(RTE_DEVICE_FRAMEWORK_CLASSIC)
        RCC->APB1ENR  |=  RCC_APB1ENR_CAN2EN;
        RCC->APB1RSTR |=  RCC_APB1RSTR_CAN2RST;
        __NOP(); __NOP(); __NOP(); __NOP(); 
        RCC->APB1RSTR &= ~RCC_APB1RSTR_CAN2RST;
#else
        HAL_CAN_MspInit(&hcan2);
#endif
        if ((RCC->APB1ENR & RCC_APB1ENR_CAN1EN) == 0U) {
          // If CAN1 (master) clock is not enabled, enable it as it is necessary for filter operation
          RCC->APB1ENR  |=  RCC_APB1ENR_CAN1EN;
          RCC->APB1RSTR |=  RCC_APB1RSTR_CAN1RST;
          __NOP(); __NOP(); __NOP(); __NOP(); 
          RCC->APB1RSTR &= ~RCC_APB1RSTR_CAN1RST;
        }
      }
#endif

      ptr_CAN->MCR = CAN_MCR_RESET;             // Reset CAN controller
      while ((ptr_CAN->MCR & CAN_MCR_RESET) != 0U);

      // Initialize filter banks
      CAN1->FMR   =  CAN_FMR_FINIT | ((CAN1_FILTER_BANK_NUM << 8) & CAN_FMR_CAN2SB);
      msk         =  ((uint32_t)1U << bank_end) - ((uint32_t)1U << bank);
      CAN1->FMR  |=  CAN_FMR_FINIT;             // Enter filter initialization mode
      CAN1->FA1R &= ~msk;                       // Put all filters in inactive mode
      CAN1->FM1R &= ~msk;                       // Initialize all filters mode
      CAN1->FS1R &= ~msk;                       // Initialize all filters scale configuration
      while (bank <= bank_end) {                // Go through all banks
        if (bank == bank_end) { break; }
        CAN1->sFilterRegister[bank].FR1 = 0U;
        CAN1->sFilterRegister[bank].FR2 = 0U;
        bank++;
      }

      memset(&can_obj_cfg[x][0], 0, CAN_TOT_OBJ_NUM);

      ptr_CAN->IER =   CAN_IER_TMEIE  |         // Enable Interrupts
                       CAN_IER_FMPIE0 |
                       CAN_IER_FOVIE0 |
                       CAN_IER_FMPIE1 |
                       CAN_IER_FOVIE1 |
                       CAN_IER_EWGIE  |
                       CAN_IER_EPVIE  |
                       CAN_IER_BOFIE  |
                       CAN_IER_ERRIE  ;

      can_driver_powered[x] = 1U;

#if defined(RTE_DEVICE_FRAMEWORK_CLASSIC)
#if (MX_CAN1 == 1U)
      if (x == 0U) {
        if ((CAN_SignalUnitEvent[0] != NULL) || (CAN_SignalObjectEvent[0] != NULL)) {
          NVIC_ClearPendingIRQ (CAN1_TX_IRQn);
          NVIC_EnableIRQ       (CAN1_TX_IRQn);
          NVIC_ClearPendingIRQ (CAN1_RX0_IRQn);
          NVIC_EnableIRQ       (CAN1_RX0_IRQn);
          NVIC_ClearPendingIRQ (CAN1_RX1_IRQn);
          NVIC_EnableIRQ       (CAN1_RX1_IRQn);
        }
        if (CAN_SignalUnitEvent[0] != NULL) {
          NVIC_ClearPendingIRQ (CAN1_SCE_IRQn);
          NVIC_EnableIRQ       (CAN1_SCE_IRQn);
        }
      }
#endif
#if (MX_CAN2 == 1U)
      if (x == 1U) {
        if ((CAN_SignalUnitEvent[1] != NULL) || (CAN_SignalObjectEvent[1] != NULL)) {
          NVIC_ClearPendingIRQ (CAN2_TX_IRQn);
          NVIC_EnableIRQ       (CAN2_TX_IRQn);
          NVIC_ClearPendingIRQ (CAN2_RX0_IRQn);
          NVIC_EnableIRQ       (CAN2_RX0_IRQn);
          NVIC_ClearPendingIRQ (CAN2_RX1_IRQn);
          NVIC_EnableIRQ       (CAN2_RX1_IRQn);
        }
        if (CAN_SignalUnitEvent[1] != NULL) {
          NVIC_ClearPendingIRQ (CAN2_SCE_IRQn);
          NVIC_EnableIRQ       (CAN2_SCE_IRQn);
        }
      }
#endif
#endif
      break;

    default:
      return ARM_DRIVER_ERROR_UNSUPPORTED;
  }

  return ARM_DRIVER_OK;
}
#if (MX_CAN1 == 1U)
static int32_t CAN1_PowerControl (ARM_POWER_STATE state) { return CANx_PowerControl (state, 0U); }
#endif
#if (MX_CAN2 == 1U)
static int32_t CAN2_PowerControl (ARM_POWER_STATE state) { return CANx_PowerControl (state, 1U); }
#endif

/**
  \fn          uint32_t CAN_GetClock (void)
  \brief       Retrieve CAN base clock frequency.
  \return      base clock frequency
*/
uint32_t CAN_GetClock (void) {
  return HAL_RCC_GetPCLK1Freq();
}

/**
  \fn          int32_t CANx_SetBitrate (ARM_CAN_BITRATE_SELECT select, uint32_t bitrate, uint32_t bit_segments, uint8_t x)
  \brief       Set bitrate for CAN interface.
  \param[in]   select       Bitrate selection
                 - ARM_CAN_BITRATE_NOMINAL : nominal (flexible data-rate arbitration) bitrate
                 - ARM_CAN_BITRATE_FD_DATA : flexible data-rate data bitrate
  \param[in]   bitrate      Bitrate
  \param[in]   bit_segments Bit segments settings
  \param[in]   x            Controller number (0..1)
  \return      execution status
*/
static int32_t CANx_SetBitrate (ARM_CAN_BITRATE_SELECT select, uint32_t bitrate, uint32_t bit_segments, uint8_t x) {
  CAN_TypeDef *ptr_CAN;
  uint32_t     mcr, sjw, prop_seg, phase_seg1, phase_seg2, pclk, brp, tq_num;

  if (x >= CAN_CTRL_NUM)                 { return ARM_DRIVER_ERROR;               }
  if (select != ARM_CAN_BITRATE_NOMINAL) { return ARM_CAN_INVALID_BITRATE_SELECT; }
  if (can_driver_powered[x] == 0U)       { return ARM_DRIVER_ERROR;               }

